package ru.skillbox.presentation_patterns.utils

const val SUCCESS_WEATHER = "Температура успешно получена.\nОжидайте перехода на страницу детальной информации"
const val ERROR_WEATHER = "Ошибка, возможные причины:\n1) Не найден город. Попробуйте ввести по английски.\n2) Нет соединения с интернетом для поиска нового города\n3) Сервис временно не доступен. Ограничение по кол-ву запросов."
const val LOCAL_WEATHER = "Температура сохраненная ранее\nДанные не смогли обновиться."
const val WAIT_WEATHER = "Осуществляется запрос в гидрометцентр"